[CombatStims X2AbilityTemplate]
LocFriendlyName="Overdrive Serum"
LocHelpText="Gain bonus mobility, mental immunity, and 2 armor for the next <Ability:COMBATSTIMSDURATION/> turns. Does not cost an action to activate."
LocLongDescription="A soldier taking Overdrive Serum receives bonus mobility, mental immunity, and 2 armor for the next <Ability:COMBATSTIMSDURATION/> turns."
LocFlyOverText="Overdrive Serum"

[CombatStims X2WeaponTemplate]
FriendlyName="Overdrive Serum"
FriendlyNamePlural="Overdrive Serums"
BriefSummary="Overdrive Serum, derived from the adrenal glands of a Berserker alien, boosts a soldier's nervous system, resulting in greater mobility and bonus armor for multiple turns."
TacticalText="<Bullet/> Overdrive Serum grants a significant boost to mobility, and a soldier on Overdrive Serum is granted bonus armor.\n<Bullet/> Overdrive Serum also makes the soldier temporarily immune to negative mental effects like panic and mind control.\n<Bullet/> 1 charge."


[MeleeResistance X2AbilityTemplate]
LocFriendlyName="Melee Resistance"
LocLongDescription="Berserkers take 2 less damage from all melee attacks."
LocHelpText="Reduced damage from melee."
LocFlyOverText="Melee Resistance"

[Rage X2AbilityTemplate]
LocFriendlyName="Rage"
LocLongDescription="The Berserker, when wounded, can be enraged, granting a mobility and Will boost."
LocHelpText="The Berserker can be enraged, granting bonuses to movement radius and Will."
LocFlyOverText="Enraged!"

[TriggerRage X2AbilityTemplate]
LocFriendlyName="Rage Triggered"
LocLongDescription="The Berserker is enraged and granted +7 mobility and 100% increase to Will ."



